; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-3-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p1-0 - location
	p1-2 - location
	p1-4 - location
	p2-3 - location
	p3-0 - location
	p3-5 - location
	p5-0 - location
	p5-3 - location
	p5-6 - location
	p6-0 - location
	p6-1 - location
	p6-2 - location
	p6-4 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at package1 s6)
	(at package2 s2)
	(at package3 s5)
	(at package4 s0)
	(at package5 s1)
	(at package6 s0)
	(at package7 s0)
	(at package8 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s5)
	(link s5 s1)
	(link s1 s6)
	(link s6 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s4)
	(link s4 s5)
	(link s6 s0)
	(link s0 s6)
)
	(:goal (and
	(at driver1 s4)
	(at truck2 s5)
	(at package1 s4)
	(at package2 s2)
	(at package3 s3)
	(at package5 s2)
	(at package6 s3)
	(at package7 s5)
	(at package8 s4)
	))


)

; plan
1. (load-truck s6 package1 truck1)
   deleted: (at package1 s6)
   added: (in package1 truck1)
   goals met: 1 of 9
2. (board-truck driver1 s5 truck3)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 1 of 9
3. (walk driver3 s1 p6-1)
   deleted: (at driver3 s1)
   added: (at driver3 p6-1)
   goals met: 1 of 9
4. (walk driver3 p6-1 s6)
   deleted: (at driver3 p6-1)
   added: (at driver3 s6)
   goals met: 1 of 9
5. (load-truck s5 package3 truck3)
   deleted: (at package3 s5)
   added: (in package3 truck3)
   goals met: 1 of 9
6. (drive-truck driver1 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 1 of 9
7. (unload-truck s3 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s3)
   goals met: 2 of 9
8. (board-truck driver3 s6 truck1)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 9
9. (drive-truck driver1 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 2 of 9
10. (load-truck s0 package7 truck3)
   deleted: (at package7 s0)
   added: (in package7 truck3)
   goals met: 2 of 9
11. (load-truck s0 package6 truck3)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   goals met: 2 of 9
12. (drive-truck driver1 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 2 of 9
13. (unload-truck s3 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s3)
   goals met: 3 of 9
14. (drive-truck driver1 s3 s1 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   goals met: 3 of 9
15. (load-truck s1 package8 truck3)
   deleted: (at package8 s1)
   added: (in package8 truck3)
   goals met: 3 of 9
16. (drive-truck driver1 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 3 of 9
17. (drive-truck driver1 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 3 of 9
18. (unload-truck s4 package8 truck3)
   deleted: (in package8 truck3)
   added: (at package8 s4)
   goals met: 4 of 9
19. (drive-truck driver1 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 4 of 9
20. (unload-truck s5 package7 truck3)
   deleted: (in package7 truck3)
   added: (at package7 s5)
   goals met: 5 of 9
21. (drive-truck driver1 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 5 of 9
22. (disembark-truck driver1 s4 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 6 of 9
23. (drive-truck driver3 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 6 of 9
24. (walk driver2 s1 p6-1)
   deleted: (at driver2 s1)
   added: (at driver2 p6-1)
   goals met: 6 of 9
25. (walk driver2 p6-1 s6)
   deleted: (at driver2 p6-1)
   added: (at driver2 s6)
   goals met: 6 of 9
26. (board-truck driver2 s6 truck2)
   deleted: (at driver2 s6) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 6 of 9
27. (drive-truck driver2 s6 s4 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   goals met: 6 of 9
28. (drive-truck driver2 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 7 of 9
29. (load-truck s1 package5 truck1)
   deleted: (at package5 s1)
   added: (in package5 truck1)
   goals met: 7 of 9
30. (drive-truck driver3 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 7 of 9
31. (unload-truck s2 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 8 of 9
32. (drive-truck driver3 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 8 of 9
33. (unload-truck s4 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   goals met: 9 of 9
